{
  "homepage.urlPreview.placeholder": "Нажмите на часть URL, чтобы узнать больше",
  "footer.copyright": "Сделано с любовью от {author}",
  "url.http.protocol.name": "Протокол",
  "url.http.protocol.definition": "Протокол описывает содержимое и характер коммуникации между браузером и сервером.",
  "url.http.protocol.description": "Самые частовстречаемые протоколы в веб это <strong>HTTPS</strong> и <strong>HTTP</strong>, которые предназначены для работы с документами гипертекста (HTML). Однако, есть и множество других протоколов, как, например, FTP (File Transfer Protocol) для передачи файлов, или POP (Post Office Protocol) для отправки и получения писем.",
  "url.http.domain.name": "Доменное имя",
  "url.http.domain.definition": "Домен это читабельный адресс сервера.",
  "url.http.domain.description": "<p>На самом деле все сервера имеют IP адресс (например, <code>111.22.33.44</code>), но поскольку такой формат труднозапоминаем и может менятся, мы часто используем доменные имена как синонимы.</p><p>Во время запроса доменное имя обрабатывается через DNS (Domain Name Servers) и мы получаем актуальный IP адресс сервера.</p>",
  "url.http.port.name": "Порт",
  "url.http.port.definition": "Номер порта используется сервером для разного рода сервисов.",
  "url.http.port.description": "<p>Поскольку один сервер может выполнять несколько вещей, таких как хостинг веб-страниц или передача файлов, каждый из этих сервисов будет доступен на разных портах.</p><p>Номер порта всегда обазятелен и нередко наследуется от <ProtocolLink>протокола</ProtocolLink>:</p><ul><li><code>:80</code> для HTTP</li><li><code>:443</code> для HTTPS</li></ul>",
  "url.http.path.name": "Путь",
  "url.http.path.definition": "Путь это строка, которая указывает на ресурс находящийся на сервере.",
  "url.http.path.description": "<p>Сервер, или клиент, решают как обрабатывать запросы на конкретный путь. Например, сервер может вернуть HTML содержимое страницы, или перенаправить запрос на другой сервер, вернув при этом полученные данные.</p>",
  "url.http.query.name": "Параметр",
  "url.http.query.definition": "Параметры URL это аргументы к запрашиваемому пути.",
  "url.http.query.description": "<p>Параметры записываются как пары <code>ключ=значение</code>, добавленные к пути после символа <code>?</code>. Каждый последующий параметр присоединяется с помощью символа <code>&</code>:</p><ul><li><code>?userId=123&type=reader</code></li></ul><p>Сервер может использовать параметры, как источник дополнительной информации о запросе.</p>",
  "url.http.fragment.name": "Фрагмент",
  "url.http.fragment.definition": "Фрагмент это отсылка к части на странице. Иногда ее еще называют <em>якорь</em> или <em>хэш</em>.",
  "url.http.fragment.description": "<p>В современной разработке фрагмент может также представлять состояние страницы. Один из таких примеров это маршрутизация на стороне клиента, которую вы можете наблюдать на этом сайте.</p>"
}
