{
  "homepage.urlPreview.placeholder": "Натисніть на частину URL, щоб дізнатись більше",
  "footer.copyright": "Зроблено з любов'ю від {author}",
  "url.http.protocol.name": "Протокол",
  "url.http.protocol.definition": "Протокол описує вміст та характер комунікації між браузером і сервером.",
  "url.http.protocol.description": "Найбільш вживані протоколи на веб це <strong>HTTPS</strong> та <strong>HTTP</strong>, котрі слугують для роботи з документами гіпертексту (HTML). Однак, є і безліч інших протоколів, як, наприклад, FTP (File Transfer Protocol) для передачі файлів, або POP (Post Office Protocol) для відправки та отримання пошти.",
  "url.http.domain.name": "Доменне ім'я",
  "url.http.domain.definition": "Домен це читабельна адреса серверу.",
  "url.http.domain.description": "<p>Насправді всі сервери мають IP адресу (наприклад, <code>111.22.33.44</code>), але оскільки таке значення важко запам'ятати і воно піддається змінам, ми часто використовуємо доменні імена як синоніми.</p><p>Під час запиту ім'я оброблюється через DNS (Domain Name Servers) і ми отримуємо поточну IP адресу серверу.</p>",
  "url.http.port.name": "Порт",
  "url.http.port.definition": "Номер порту використовується сервером для різного виду сервісів.",
  "url.http.port.description": "<p>Оскільки один сервер може виконувати декілька речей, таких як хостинг веб-сторінок чи передачу файлів, кожен з цих сервісів буде доступний на різних портах.</p><p>Номер порту зажди обов'язковий і нерідко наслідується від <ProtocolLink>протоколу</ProtocolLink>:</p><ul><li><code>:80</code> для HTTP</li><li><code>:443</code> для HTTPS</li></ul>",
  "url.http.path.name": "Шлях",
  "url.http.path.definition": "Шлях це рядок, що вказує на ресурс на сервері.",
  "url.http.path.description": "<p>Сервер, або клієнт, вирішують як обробляти запити на конкретний шлях. Наприклад, сервер може повернути HTML вміст сторінки, чи перенаправити запит на інший сервер, повернувши при цьому отримані данні.</p>",
  "url.http.query.name": "Параметр",
  "url.http.query.definition": "Параметри URL це аргументи до шляху.",
  "url.http.query.description": "<p>Параметри записуються як пари <code>ключ=значення</code> приєднані до шляху після символу <code>?</code>. Кожен наступний параметр додається за допомогою символу <code>&</code>:</p><ul><li><code>?userId=123&type=reader</code></li></ul><p>Сервер може використовувати параметри як джерело додаткової інформації про запит.</p>",
  "url.http.fragment.name": "Фрагмент",
  "url.http.fragment.definition": "Фрагмент це посилання до частини сторінки. Інколи його ще називають <em>якір</em> або <em>хеш</em>.",
  "url.http.fragment.description": "<p>В сучасній розробці фрагмент може також представляти стан сторінки. Один із таких прикладів це маршрутизація на стороні клієнту, котру ви можете спостерігати на цьому сайті.</p>"
}
